backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      dtype: float32
      name: input_1
      ragged: false
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization
      scale: true
      trainable: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: batch_normalization
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      dtype: float32
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d
      padding: same
      strides: &id002 !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization
        - 0
        - 0
        - {}
    name: conv2d
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d
        - 0
        - 0
        - {}
    name: batch_normalization_1
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 24
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_1
      padding: valid
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization_1
        - 0
        - 0
        - {}
    name: conv2d_1
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_1
        - 0
        - 0
        - {}
    name: batch_normalization_2
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_3
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_1
        - 0
        - 0
        - {}
    name: batch_normalization_3
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_2
      padding: valid
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization_2
        - 0
        - 0
        - {}
    name: conv2d_2
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_3
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization_3
        - 0
        - 0
        - {}
    name: conv2d_3
  - class_name: Concatenate
    config: {axis: 3, dtype: float32, name: concatenate, trainable: true}
    inbound_nodes:
    - - - conv2d_2
        - 0
        - 0
        - &id003 {}
      - - conv2d_3
        - 0
        - 0
        - *id003
    name: concatenate
  - class_name: Activation
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      dtype: float32
      name: activation
      trainable: true
    inbound_nodes:
    - - - concatenate
        - 0
        - 0
        - {}
    name: activation
  - class_name: GlobalAveragePooling2D
    config: {data_format: channels_last, dtype: float32, name: global_average_pooling2d,
      trainable: true}
    inbound_nodes:
    - - - activation
        - 0
        - 0
        - {}
    name: global_average_pooling2d
  - class_name: Dense
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      name: dense
      trainable: true
      units: 12
      use_bias: true
    inbound_nodes:
    - - - global_average_pooling2d
        - 0
        - 0
        - {}
    name: dense
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      name: dense_1
      trainable: true
      units: 192
      use_bias: true
    inbound_nodes:
    - - - dense
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: Multiply
    config: {dtype: float32, name: multiply, trainable: true}
    inbound_nodes:
    - - - activation
        - 0
        - 0
        - &id004 {}
      - - dense_1
        - 0
        - 0
        - *id004
    name: multiply
  - class_name: Activation
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      dtype: float32
      name: activation_1
      trainable: true
    inbound_nodes:
    - - - multiply
        - 0
        - 0
        - {}
    name: activation_1
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_4
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_1
        - 0
        - 0
        - {}
    name: batch_normalization_4
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 24
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_4
      padding: valid
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization_4
        - 0
        - 0
        - {}
    name: conv2d_4
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_5
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_4
        - 0
        - 0
        - {}
    name: batch_normalization_5
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_6
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_4
        - 0
        - 0
        - {}
    name: batch_normalization_6
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_5
      padding: valid
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization_5
        - 0
        - 0
        - {}
    name: conv2d_5
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_6
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization_6
        - 0
        - 0
        - {}
    name: conv2d_6
  - class_name: Concatenate
    config: {axis: 3, dtype: float32, name: concatenate_1, trainable: true}
    inbound_nodes:
    - - - conv2d_5
        - 0
        - 0
        - &id005 {}
      - - conv2d_6
        - 0
        - 0
        - *id005
    name: concatenate_1
  - class_name: Add
    config: {dtype: float32, name: add, trainable: true}
    inbound_nodes:
    - - - activation_1
        - 0
        - 0
        - &id006 {}
      - - concatenate_1
        - 0
        - 0
        - *id006
    name: add
  - class_name: Activation
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      dtype: float32
      name: activation_2
      trainable: true
    inbound_nodes:
    - - - add
        - 0
        - 0
        - {}
    name: activation_2
  - class_name: GlobalAveragePooling2D
    config: {data_format: channels_last, dtype: float32, name: global_average_pooling2d_1,
      trainable: true}
    inbound_nodes:
    - - - activation_2
        - 0
        - 0
        - {}
    name: global_average_pooling2d_1
  - class_name: Dense
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      name: dense_2
      trainable: true
      units: 12
      use_bias: true
    inbound_nodes:
    - - - global_average_pooling2d_1
        - 0
        - 0
        - {}
    name: dense_2
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      name: dense_3
      trainable: true
      units: 192
      use_bias: true
    inbound_nodes:
    - - - dense_2
        - 0
        - 0
        - {}
    name: dense_3
  - class_name: Multiply
    config: {dtype: float32, name: multiply_1, trainable: true}
    inbound_nodes:
    - - - activation_2
        - 0
        - 0
        - &id007 {}
      - - dense_3
        - 0
        - 0
        - *id007
    name: multiply_1
  - class_name: Add
    config: {dtype: float32, name: add_1, trainable: true}
    inbound_nodes:
    - - - activation_2
        - 0
        - 0
        - &id008 {}
      - - multiply_1
        - 0
        - 0
        - *id008
    name: add_1
  - class_name: Activation
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      dtype: float32
      name: activation_3
      trainable: true
    inbound_nodes:
    - - - add_1
        - 0
        - 0
        - {}
    name: activation_3
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_7
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_3
        - 0
        - 0
        - {}
    name: batch_normalization_7
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 36
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_7
      padding: valid
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization_7
        - 0
        - 0
        - {}
    name: conv2d_7
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_8
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_7
        - 0
        - 0
        - {}
    name: batch_normalization_8
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_9
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_7
        - 0
        - 0
        - {}
    name: batch_normalization_9
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 144
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_8
      padding: valid
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization_8
        - 0
        - 0
        - {}
    name: conv2d_8
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 144
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_9
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization_9
        - 0
        - 0
        - {}
    name: conv2d_9
  - class_name: Concatenate
    config: {axis: 3, dtype: float32, name: concatenate_2, trainable: true}
    inbound_nodes:
    - - - conv2d_8
        - 0
        - 0
        - &id009 {}
      - - conv2d_9
        - 0
        - 0
        - *id009
    name: concatenate_2
  - class_name: Activation
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      dtype: float32
      name: activation_4
      trainable: true
    inbound_nodes:
    - - - concatenate_2
        - 0
        - 0
        - {}
    name: activation_4
  - class_name: GlobalAveragePooling2D
    config: {data_format: channels_last, dtype: float32, name: global_average_pooling2d_2,
      trainable: true}
    inbound_nodes:
    - - - activation_4
        - 0
        - 0
        - {}
    name: global_average_pooling2d_2
  - class_name: Dense
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      name: dense_4
      trainable: true
      units: 18
      use_bias: true
    inbound_nodes:
    - - - global_average_pooling2d_2
        - 0
        - 0
        - {}
    name: dense_4
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      name: dense_5
      trainable: true
      units: 288
      use_bias: true
    inbound_nodes:
    - - - dense_4
        - 0
        - 0
        - {}
    name: dense_5
  - class_name: Multiply
    config: {dtype: float32, name: multiply_2, trainable: true}
    inbound_nodes:
    - - - activation_4
        - 0
        - 0
        - &id010 {}
      - - dense_5
        - 0
        - 0
        - *id010
    name: multiply_2
  - class_name: Activation
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      dtype: float32
      name: activation_5
      trainable: true
    inbound_nodes:
    - - - multiply_2
        - 0
        - 0
        - {}
    name: activation_5
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_10
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_5
        - 0
        - 0
        - {}
    name: batch_normalization_10
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 36
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_10
      padding: valid
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization_10
        - 0
        - 0
        - {}
    name: conv2d_10
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_11
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_10
        - 0
        - 0
        - {}
    name: batch_normalization_11
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_12
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_10
        - 0
        - 0
        - {}
    name: batch_normalization_12
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 144
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_11
      padding: valid
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization_11
        - 0
        - 0
        - {}
    name: conv2d_11
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 144
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_12
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization_12
        - 0
        - 0
        - {}
    name: conv2d_12
  - class_name: Concatenate
    config: {axis: 3, dtype: float32, name: concatenate_3, trainable: true}
    inbound_nodes:
    - - - conv2d_11
        - 0
        - 0
        - &id011 {}
      - - conv2d_12
        - 0
        - 0
        - *id011
    name: concatenate_3
  - class_name: Add
    config: {dtype: float32, name: add_2, trainable: true}
    inbound_nodes:
    - - - activation_5
        - 0
        - 0
        - &id012 {}
      - - concatenate_3
        - 0
        - 0
        - *id012
    name: add_2
  - class_name: Activation
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      dtype: float32
      name: activation_6
      trainable: true
    inbound_nodes:
    - - - add_2
        - 0
        - 0
        - {}
    name: activation_6
  - class_name: GlobalAveragePooling2D
    config: {data_format: channels_last, dtype: float32, name: global_average_pooling2d_3,
      trainable: true}
    inbound_nodes:
    - - - activation_6
        - 0
        - 0
        - {}
    name: global_average_pooling2d_3
  - class_name: Dense
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      name: dense_6
      trainable: true
      units: 18
      use_bias: true
    inbound_nodes:
    - - - global_average_pooling2d_3
        - 0
        - 0
        - {}
    name: dense_6
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      name: dense_7
      trainable: true
      units: 288
      use_bias: true
    inbound_nodes:
    - - - dense_6
        - 0
        - 0
        - {}
    name: dense_7
  - class_name: Multiply
    config: {dtype: float32, name: multiply_3, trainable: true}
    inbound_nodes:
    - - - activation_6
        - 0
        - 0
        - &id013 {}
      - - dense_7
        - 0
        - 0
        - *id013
    name: multiply_3
  - class_name: Add
    config: {dtype: float32, name: add_3, trainable: true}
    inbound_nodes:
    - - - activation_6
        - 0
        - 0
        - &id014 {}
      - - multiply_3
        - 0
        - 0
        - *id014
    name: add_3
  - class_name: Activation
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      dtype: float32
      name: activation_7
      trainable: true
    inbound_nodes:
    - - - add_3
        - 0
        - 0
        - {}
    name: activation_7
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_13
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_7
        - 0
        - 0
        - {}
    name: batch_normalization_13
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_13
      padding: valid
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization_13
        - 0
        - 0
        - {}
    name: conv2d_13
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_14
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_13
        - 0
        - 0
        - {}
    name: batch_normalization_14
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_15
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_13
        - 0
        - 0
        - {}
    name: batch_normalization_15
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 192
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_14
      padding: valid
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization_14
        - 0
        - 0
        - {}
    name: conv2d_14
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 192
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_15
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization_15
        - 0
        - 0
        - {}
    name: conv2d_15
  - class_name: Concatenate
    config: {axis: 3, dtype: float32, name: concatenate_4, trainable: true}
    inbound_nodes:
    - - - conv2d_14
        - 0
        - 0
        - &id015 {}
      - - conv2d_15
        - 0
        - 0
        - *id015
    name: concatenate_4
  - class_name: Activation
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      dtype: float32
      name: activation_8
      trainable: true
    inbound_nodes:
    - - - concatenate_4
        - 0
        - 0
        - {}
    name: activation_8
  - class_name: GlobalAveragePooling2D
    config: {data_format: channels_last, dtype: float32, name: global_average_pooling2d_4,
      trainable: true}
    inbound_nodes:
    - - - activation_8
        - 0
        - 0
        - {}
    name: global_average_pooling2d_4
  - class_name: Dense
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      name: dense_8
      trainable: true
      units: 24
      use_bias: true
    inbound_nodes:
    - - - global_average_pooling2d_4
        - 0
        - 0
        - {}
    name: dense_8
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      name: dense_9
      trainable: true
      units: 384
      use_bias: true
    inbound_nodes:
    - - - dense_8
        - 0
        - 0
        - {}
    name: dense_9
  - class_name: Multiply
    config: {dtype: float32, name: multiply_4, trainable: true}
    inbound_nodes:
    - - - activation_8
        - 0
        - 0
        - &id016 {}
      - - dense_9
        - 0
        - 0
        - *id016
    name: multiply_4
  - class_name: Activation
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      dtype: float32
      name: activation_9
      trainable: true
    inbound_nodes:
    - - - multiply_4
        - 0
        - 0
        - {}
    name: activation_9
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_16
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_9
        - 0
        - 0
        - {}
    name: batch_normalization_16
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_16
      padding: valid
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization_16
        - 0
        - 0
        - {}
    name: conv2d_16
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_17
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_16
        - 0
        - 0
        - {}
    name: batch_normalization_17
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_18
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_16
        - 0
        - 0
        - {}
    name: batch_normalization_18
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 192
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_17
      padding: valid
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization_17
        - 0
        - 0
        - {}
    name: conv2d_17
  - class_name: Conv2D
    config:
      activation:
        class_name: Mish
        config: {activation: mish, dtype: float32, name: mish, trainable: true}
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 192
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_18
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - batch_normalization_18
        - 0
        - 0
        - {}
    name: conv2d_18
  - class_name: Concatenate
    config: {axis: 3, dtype: float32, name: concatenate_5, trainable: true}
    inbound_nodes:
    - - - conv2d_17
        - 0
        - 0
        - &id017 {}
